Documents/ESB/ESB_Consumer_0612/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA05_PreDsgntdAcctInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/PreDsgntdAcctInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>PreDsgntdAcctInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:PreDsgntdAcctInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA05</v11:TxnId>  
        <v11:TxnNo>DA0500001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>K136908817</v11:CustPermId>  
        <v11:InqType>All</v11:InqType> 
      </v11:ServiceBody> 
    </v11:PreDsgntdAcctInqRq> 
  </soap:Body> 
</soap:Envelope>
